Revit 2027 API
AnalyticalSurfaceBase.GetOuterContour Method
 Returns the Curve Loop that defines the geometry of the Analytical Surface element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoop GetOuterContour()
Public Function GetOuterContour As CurveLoop
public:
CurveLoop^ GetOuterContour()
member GetOuterContour : unit -> CurveLoop
Return Value
CurveLoop
 CurveLoop associated with Analytical Surface element.
See Also
Reference
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace